documentation/present.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-10-04 Tue 14:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>(sub) Target Analysis Pipeline</title>
<meta name="author" content="Vishal Sood" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">(sub) Target Analysis Pipeline</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org176c89a">1. To analyze sub-targets in a circuit.</a>
<ul>
<li><a href="#orgb62e07f">1.1. PROBLEM</a></li>
<li><a href="#orga34bfbc">1.2. SOLUTION: TAP</a>
<ul>
<li><a href="#org5a2cc6d">1.2.1. <code>tap-env</code>: Circuit Analysis Compute Environemnt</a></li>
<li><a href="#org3237b2c">1.2.2. <code>tap-store</code>: A HDFstore to hold the analysis data</a></li>
<li><a href="#orga71ffa2">1.2.3. <code>tap-config</code>: A Reporducible document in the form of a YAML / JSON config file</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgadf7e52">2. ANALYSIS</a></li>
<li><a href="#org164d752">3. SUBTARGET</a></li>
<li><a href="#org6b3f386">4. TAP Config</a>
<ul>
<li><a href="#org366fc9a">4.1. Paths</a></li>
<li><a href="#org360e818">4.2. Parameters</a>
<ul>
<li><a href="#org466c201">4.2.1. Define Subtargets</a></li>
<li><a href="#orgcdbd366">4.2.2. Extract Nodes</a></li>
<li><a href="#orgd36aee5">4.2.3. Extract edges</a></li>
<li><a href="#orgf5ee282">4.2.4. Analyze Connectivity</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb93a331">5. TAP environment</a></li>
</ul>
</div>
</div>

<div id="outline-container-org176c89a" class="outline-2">
<h2 id="org176c89a"><span class="section-number-2">1.</span> To analyze sub-targets in a circuit.</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>connsense-TAP</b>  offers a solution to a problem,
</p>
</div>

<div id="outline-container-orgb62e07f" class="outline-3">
<h3 id="orgb62e07f"><span class="section-number-3">1.1.</span> PROBLEM</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Our circuits are as detailed as the current state of the art experimental data and algorithms allow. Circuit data artefacts are complex and ridden with neuroscience and informatics jargon &#x2014; both of which can be a hurdle in analyzing a circuit reconstruction.
</p>

<ol class="org-ol">
<li>Physically large circuit &#x2014; analyses, unless parallelized, can be slow</li>

<li>Book-keeping analyses results can be a head-ache</li>

<li>Too much neuroscientific and informatic jargon to load a circuit to analyze</li>
</ol>
</div>
</div>


<div id="outline-container-orga34bfbc" class="outline-3">
<h3 id="orga34bfbc"><span class="section-number-3">1.2.</span> SOLUTION: TAP</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org5a2cc6d" class="outline-4">
<h4 id="org5a2cc6d"><span class="section-number-4">1.2.1.</span> <code>tap-env</code>: Circuit Analysis Compute Environemnt</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Follow conventions to provide methods on individual <code>circuit-subtargets</code> that <code>TAP</code> will parallelize.
</p>
</div>
</div>

<div id="outline-container-org3237b2c" class="outline-4">
<h4 id="org3237b2c"><span class="section-number-4">1.2.2.</span> <code>tap-store</code>: A HDFstore to hold the analysis data</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Use an interface to interact with the analyzed data and generate reports
</p>
</div>
</div>

<div id="outline-container-orga71ffa2" class="outline-4">
<h4 id="orga71ffa2"><span class="section-number-4">1.2.3.</span> <code>tap-config</code>: A Reporducible document in the form of a YAML / JSON config file</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
Use the config to reproduce analyses on existing or new circuits.
</p>
</div>
</div>
</div>
</div>


<div id="outline-container-orgadf7e52" class="outline-2">
<h2 id="orgadf7e52"><span class="section-number-2">2.</span> ANALYSIS</h2>
</div>


<div id="outline-container-org164d752" class="outline-2">
<h2 id="org164d752"><span class="section-number-2">3.</span> SUBTARGET</h2>
<div class="outline-text-2" id="text-3">
<p>
An analysis will be that of the entire circuit, or a <code>circuit-subtarget</code> that can be represented simply as a collection of neurons. We may parcellate the brain&rsquo;s physical shape into constituent blocks and study how a brain circuit phenomenon varies across these <code>subtargets</code>.
</p>

<p>
The rat-SSCx circuit has 8 subregions, with a total of 4.5 million neurons. The upcoming mouse-IsoCortex will have the entire neocortex with more than 10 million neurons. We may define each region as a <code>subtarget</code> and analyze the distribution of neurons across them.
</p>

<p>
Or we may be interested in a brain-circuit parcellation that arises from a biological phenomenon, and define <code>subtargets</code> accordingly. Parcellation of the SSCx into conical <code>subtargets</code> oriented along cortical layers can be used to study the composition and connectivity of these columnar <code>subtargets</code> in relation to white-matter innervation that follows a similar columnar pattern.
</p>
</div>
</div>


<div id="outline-container-org6b3f386" class="outline-2">
<h2 id="org6b3f386"><span class="section-number-2">4.</span> TAP Config</h2>
<div class="outline-text-2" id="text-4">
<p>
Let us start by configuring a <code>connsense-TAP</code>. We will write a <code>YAML</code> config, starting with a header to help us track our progress.
</p>

<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #BA36A5;">description</span>: &gt;-
  <span style="color: #008000;">Configure a connsense subTarget Analysis Pipeline to analyze your circuit.</span>
<span style="color: #BA36A5;">version</span>: 0.0.0
<span style="color: #BA36A5;">date</span>: 20221003
</pre>
</div>

<p>
There are two <code>TAP</code> config sections we need to fill,
</p>
</div>

<div id="outline-container-org366fc9a" class="outline-3">
<h3 id="org366fc9a"><span class="section-number-3">4.1.</span> Paths</h3>
<div class="outline-text-3" id="text-4-1">
<p>
We need to first describe the input / output paths to <code>connsense-TAP</code>. We need a path to the circuits we will analyze. <code>TAP</code> assumes that all of these circuits are the same <i>brain-model</i>.
</p>

<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #BA36A5;">paths</span>:
  <span style="color: #BA36A5;">description</span>: &gt;-
    <span style="color: #008000;">The ~connsense~ pipeline needs paths to the input data to load from, and output paths to store data.</span>
<span style="color: #008000;">    Paths to the circuit must be provided along with paths to the HDF5 archive that will store the pipeline's</span>
<span style="color: #008000;">    results.</span>
  <span style="color: #BA36A5;">format</span>: relative
  <span style="color: #BA36A5;">circuit</span>:
    <span style="color: #BA36A5;">root</span>: <span style="color: #008000;">"/gpfs/bbp.cscs.ch/project/proj83/circuits"</span>
    <span style="color: #BA36A5;">files</span>:
      <span style="color: #BA36A5;">Bio_M</span>: <span style="color: #008000;">"Bio_M/20200805/CircuitConfig_TC_WM"</span>
  <span style="color: #BA36A5;">pipeline</span>:
    <span style="color: #BA36A5;">root</span>: <span style="color: #008000;">"/gpfs/bbp.cscs.ch/project/proj83/home/sood/topological-analysis-subvolumes/test/v2"</span>
    <span style="color: #BA36A5;">input</span>:
      <span style="color: #BA36A5;">store</span>: <span style="color: #008000;">"connsense.h5"</span>
    <span style="color: #BA36A5;">output</span>:
      <span style="color: #BA36A5;">store</span>: <span style="color: #008000;">"connsense.h5"</span>
    <span style="color: #BA36A5;">steps</span>:
      <span style="color: #BA36A5;">define-subtargets</span>: <span style="color: #008000;">"subtargets"</span>
      <span style="color: #BA36A5;">extract-node-populations</span>: <span style="color: #008000;">"nodes/populations"</span>
      <span style="color: #BA36A5;">extract-edge-populations</span>: <span style="color: #008000;">"edges/populations"</span>
      <span style="color: #BA36A5;">analyze-connectivity</span>: <span style="color: #008000;">"analyses/connectivity"</span>

</pre>
</div>

<p>
As the config above suggests, we will have four distinct steps in our <code>connsense-TAP</code> run. We can add steps as we progress. Let us look at the four steps that we have configured.
</p>
</div>
</div>
