documentation/present.html

<div id="outline-container-org360e818" class="outline-3">
<h3 id="org360e818"><span class="section-number-3">4.2.</span> Parameters</h3>
<div class="outline-text-3" id="text-4-2">
<p>
The second section concerns with the parameters that <code>connsense-TAP</code> will use to run computations. The starting point will be the definitions of <code>circuit-subtargets</code>. We consider spatially defined subtargets, hexagonal prism shaped columns defined using a mapping to the circuit&rsquo;s <code>flatmap</code>. To track the computations as the pipeline progresses, <code>connsense-TAP</code> will use an indexing scheme. We need to declare the variables to use in the index. Here we want to study a circuit&rsquo;s connectivity &#x2014; so the circuit&rsquo;s connectome will be one of the variables. We will have <code>subtargets</code> within the circuit connectome that we want to study as indpendent circuits.
</p>

<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #BA36A5;">parameters</span>:
  <span style="color: #BA36A5;">create-index</span>:
    <span style="color: #BA36A5;">description</span>:
      Create tap-store indices by listing datasets for each index variable.
    <span style="color: #BA36A5;">variables</span>:
      <span style="color: #BA36A5;">circuit</span>:
        - <span style="color: #008000;">"Bio_M"</span>
      <span style="color: #BA36A5;">connectome</span>:
        - <span style="color: #008000;">"local"</span>
      <span style="color: #BA36A5;">subtarget</span>:
        <span style="color: #BA36A5;">dataset</span>: [<span style="color: #008000;">"define-subtargets"</span>, <span style="color: #008000;">"flatmap-columns/name"</span>]

</pre>
</div>

<p>
We have used a  reference to a dataset that our <code>connsense-TAP</code> instance is expected to have when it needs that dataset to create an index for <code>subtargets</code>. The reference can be read as <code>(computation-type dataset)</code>. So here we refered to the dataset that is the result of <code>define-subtargets</code> dataset <code>flatmap-columns/name</code>.
</p>

<p>
We have entered this <i>zeroth</i> <code>step</code> because it is not really a <code>computation</code> that is run independently. The information is used within <code>connsense-TAP</code> for indexing.
</p>

<p>
Let us look at the steps that contain science,
</p>
</div>


<div id="outline-container-org466c201" class="outline-4">
<h4 id="org466c201"><span class="section-number-4">4.2.1.</span> Define Subtargets</h4>
<div class="outline-text-4" id="text-4-2-1">
<p>
The <i>first</i> step is to define the <code>subtargets</code>. Each <code>subtarget</code> will have a name, and a set of <code>gids</code> associated with it. There is a variety of specifications that <code>connsense-TAP</code> understands. For our use we will specify path to an <code>NRRD</code> that maps <code>voxel --&gt; subtarget_id</code>, with information that maps <code>subtarget_id --&gt; subtarget info</code>. Along with paths to data <code>connsense-TAP</code> will need a method that <i>defines</i> the subtargets. We point to a method within <code>connsense</code>.
</p>

<div class="org-src-container">
<pre class="src src-yaml">  <span style="color: #BA36A5;">define-subtargets</span>:
    <span style="color: #BA36A5;">description</span>: &gt;-
      <span style="color: #008000;">Configure how subtargets are defined.</span>
    <span style="color: #BA36A5;">definitions</span>:
      <span style="color: #BA36A5;">flatmap-columns</span>:
        <span style="color: #BA36A5;">description</span>: &gt;-
          <span style="color: #008000;">Hexaongal prism like columns oriented along cortical layers, from white-matter to pia.</span>
<span style="color: #008000;">          The data is loaded from an NRRD file that maps each circuit voxel to a subtarget ids</span>
<span style="color: #008000;">          corresponding to a flatmap column.The subtarget ids should be mapped to the subtargets</span>
<span style="color: #008000;">          they refer to in a dataframe provided as the input `info`.</span>
        <span style="color: #BA36A5;">input</span>:
          <span style="color: #BA36A5;">circuit</span>:
            - <span style="color: #008000;">"Bio_M"</span>
        <span style="color: #BA36A5;">kwargs</span>:
          <span style="color: #BA36A5;">path</span>: <span style="color: #008000;">"/gpfs/bbp.cscs.ch/project/proj83/home/reimann/subvolumes/column_identities.nrrd"</span>
          <span style="color: #BA36A5;">info</span>: <span style="color: #008000;">"/gpfs/bbp.cscs.ch/project/proj83/home/reimann/subvolumes/voxel-based-hex-grid-info.h5"</span>
        <span style="color: #BA36A5;">loader</span>:
          <span style="color: #BA36A5;">source</span>: connsense.define_subtargets.flatmap
          <span style="color: #BA36A5;">method</span>: load_nrrd

</pre>
</div>

<p>
This step will save data under the references
</p>

<ol class="org-ol">
<li><code>["define-subtargets", "flatmap-columns/name"]</code> that are names of each <code>subtarget</code></li>
<li><code>["define-subtargets", "flatmap-columns/info"]</code> that is the <code>info</code> for each <code>subtarget</code></li>
<li><code>["define-subtargets", "flatmap-columns"]</code> that are the gids contained in each <code>subtarget</code></li>
</ol>
</div>
</div>


<div id="outline-container-orgcdbd366" class="outline-4">
<h4 id="orgcdbd366"><span class="section-number-4">4.2.2.</span> Extract Nodes</h4>
<div class="outline-text-4" id="text-4-2-2">
<p>
We will need node properties for each of the subtargets. We follow <i>SONATA</i> to extract <code>node-populations</code> from the circuit.
</p>

<div class="org-src-container">
<pre class="src src-yaml">  <span style="color: #BA36A5;">extract-node-populations</span>:
    <span style="color: #BA36A5;">description</span>: &gt;-
      <span style="color: #008000;">Specify the populations to extract from a circuit.</span>
    <span style="color: #BA36A5;">populations</span>:
      <span style="color: #BA36A5;">default</span>:
        <span style="color: #BA36A5;">description</span>: &gt;-
          <span style="color: #008000;">The default population will be that of neurons in the SSCx.</span>
<span style="color: #008000;">          To extract the neurons we will use a `connsense` method that uses ~bluepy~.</span>
        <span style="color: #BA36A5;">input</span>:
          <span style="color: #BA36A5;">subtarget</span>:
            <span style="color: #BA36A5;">dataset</span>:  [<span style="color: #008000;">"define-subtargets"</span>, <span style="color: #008000;">"flatmap-columns"</span>]
          <span style="color: #BA36A5;">circuit</span>:
            - <span style="color: #008000;">"Bio_M"</span>
        <span style="color: #BA36A5;">kwargs</span>:
          <span style="color: #BA36A5;">properties</span>:
            - region
            - layer
            - x
            - <span style="color: #D0372D;">y</span>
            - z
            - depth
            - synapse_class
            - mtype
            - etype
            - morphology
        <span style="color: #BA36A5;">extractor</span>:
          <span style="color: #BA36A5;">source</span>: connsense.extract_nodes.bluepy
          <span style="color: #BA36A5;">method</span>: extract_node_properties
        <span style="color: #BA36A5;">output</span>: <span style="color: #008000;">"pandas.DataFrame"</span>
</pre>
</div>

<p>
The configuration above can be used as a template to understand the general <i>syntax</i> that <code>connsense-TAP</code> uses to interpret <code>parameters</code> entries. Each step is that of a <code>computation-type</code>. A <code>computation-type</code> will have key associated with values that is a list of the <code>quantities</code> that will be computed.
</p>

<p>
For example, to extract nodes, we have listed <code>populations</code> whose nodes will be extracted. For the SSCx circuits we have only one population of biophysical cells that we named <code>default</code>.
</p>

<p>
For each <code>quantity</code> to be computed, <code>connsense-TAP</code> will need to load it&rsquo;s input. In our case the inputs are the <code>flatmap-columns</code> that we have referenced as shown in the config. We may have more than one circuit to analyze, so that too goes in the <code>inputs</code>. The workhorse will be the <code>extractor</code> specified above &#x2014; a method within <code>connsense</code> &#x2014;. The <code>inputs</code> are the arguments to the referenced <code>Python</code> method, and <code>kwargs</code> it&rsquo;s key-word arguments. We follow the convention that <code>inputs</code> can be loaded from other <code>connsense-TAP</code> steps and hence entered as <i>implicity</i> references, while <code>kwargs</code> are some other parameters that the scientist will need to enter <i>explitcitly</i>. In the example of <code>extract-node-populations</code> we have specified extraction of cell properties. The <code>output</code> type of the method used is required by <code>connsense-TAP</code> to format the saved data.
</p>
</div>
</div>
