documentation/present.html

<div id="outline-container-orgd36aee5" class="outline-4">
<h4 id="orgd36aee5"><span class="section-number-4">4.2.3.</span> Extract edges</h4>
<div class="outline-text-4" id="text-4-2-3">
<p>
We will extract subtarget edges as <code>scipy.sparse</code> adjacency matrices. This choice is driven mostly by the computational requirement of network topology algorithms that use adjacency matrices.
</p>

<div class="org-src-container">
<pre class="src src-yaml">  <span style="color: #BA36A5;">extract-edge-populations</span>:
    <span style="color: #BA36A5;">description</span>: &gt;-
      <span style="color: #008000;">Specify the connectomes to extract from.</span>
<span style="color: #008000;">      Connections will be extracted for each subtarget as an adjacency matrix, with or without connection-strengths.</span>
<span style="color: #008000;">      A connection is between a pair of source and target nodes, and may be a multi-edge connection.</span>
<span style="color: #008000;">      We will also specify a set of edge-properties to extract from the circuit.</span>
    <span style="color: #BA36A5;">populations</span>:
      <span style="color: #BA36A5;">local</span>:
        <span style="color: #BA36A5;">input</span>:
          <span style="color: #BA36A5;">subtarget</span>:
            <span style="color: #BA36A5;">dataset</span>:  [<span style="color: #008000;">"define-subtargets"</span>, <span style="color: #008000;">"flatmap-columns"</span>]
          <span style="color: #BA36A5;">circuit</span>:
            - <span style="color: #008000;">"Bio_M"</span>
          <span style="color: #BA36A5;">connectome</span>:
            - <span style="color: #008000;">"local"</span>
        <span style="color: #BA36A5;">kwargs</span>:
          <span style="color: #BA36A5;">sources</span>: <span style="color: #008000;">"intrinsic"</span>
        <span style="color: #BA36A5;">extractor</span>:
          <span style="color: #BA36A5;">source</span>: connsense.extract_connectivity.bluepy
          <span style="color: #BA36A5;">method</span>: extract_adj
        <span style="color: #BA36A5;">output</span>: <span style="color: #008000;">"sparse.spmatrix"</span>
</pre>
</div>

<p>
There is nothing new here, other than the details of the computation. We specify that the inputs will be <code>(subtarget, circuit, connectome)</code> with their values or references. In <code>kwargs</code> we have set <code>sources</code> as <i>intrinsic</i> which allows the <code>extractor</code> to distinguish extraction of connections among the <i>biophysical</i> SSCx population from an extraction where the <code>sources</code> are extrinsic, for example the virtual thalamic cells defined in the reconstruction.
</p>
</div>
</div>

<div id="outline-container-orgf5ee282" class="outline-4">
<h4 id="orgf5ee282"><span class="section-number-4">4.2.4.</span> Analyze Connectivity</h4>
<div class="outline-text-4" id="text-4-2-4">
<p>
We can have several <code>analyzes-computation-types</code>, each motivated by the needs of the computations required by specific circuit phenomena. The scientist can choose their own name prefixed by <code>analyze-</code>.  For our case, a study of the circuit&rsquo;s network topology we are interested in <code>analyze-connectivity</code>,
</p>

<div class="org-src-container">
<pre class="src src-yaml" id="org59a1411"><span style="color: #BA36A5;">analyze-connectivity</span>:
  <span style="color: #BA36A5;">description</span>: &gt;-
    <span style="color: #008000;">Configure each analyses' parameters, as a mapping under section `analyses`.</span>
  <span style="color: #BA36A5;">analyses</span>:
</pre>
</div>

<p>
We can list as many analyses as we want. Let us start with a computationally simple one,
</p>
</div>

<ol class="org-ol">
<li><a id="orgc4d4ae1"></a>Simplex counts<br />
<div class="outline-text-5" id="text-4-2-4-1">
<p>
To configure a <code>connsense-TAP</code> computation of <code>simplex-counts</code> over all the subtargets,
</p>

<div class="org-src-container">
<pre class="src src-yaml" id="orgebaaefd"><span style="color: #BA36A5;">simplex-counts</span>:
  <span style="color: #BA36A5;">description</span>: &gt;-
    <span style="color: #008000;">Number of simplices by dimension.</span>

  <span style="color: #BA36A5;">index</span>:
    <span style="color: #BA36A5;">subtarget</span>:
      <span style="color: #BA36A5;">dataset</span>: [<span style="color: #008000;">"define-subtargets"</span>, <span style="color: #008000;">"flatmap-columns"</span>]
    <span style="color: #BA36A5;">circuit</span>:
      - <span style="color: #008000;">"Bio_M"</span>
    <span style="color: #BA36A5;">connectome</span>:
      - <span style="color: #008000;">"local"</span>

  <span style="color: #BA36A5;">input</span>:
    <span style="color: #BA36A5;">adjacency</span>:
      <span style="color: #BA36A5;">dataset</span>: [<span style="color: #008000;">"extract-edge-populations"</span>, <span style="color: #008000;">"local"</span>]

  <span style="color: #BA36A5;">computation</span>:
    <span style="color: #BA36A5;">source</span>: <span style="color: #008000;">"/gpfs/bbp.cscs.ch/project/proj83/analyses/topological-analysis-subvolumes/proj83/connectome_analysis/library/topology.py"</span>
    <span style="color: #BA36A5;">method</span>: <span style="color: #008000;">"simplex_counts"</span>

  <span style="color: #BA36A5;">output</span>: <span style="color: #008000;">"pandas.DataFrame"</span>
</pre>
</div>

<p>
It is important to separate a <code>computation</code>&rsquo;s <code>index</code> from it&rsquo;s <code>input</code>. The entries in <code>input</code> are the arguments of the <code>computation-method</code> entry, while <code>index</code> is an instruction to <code>connsense-TAP</code> to which subtargets the computation should be applied to. For <code>simplex-counts</code> we want to apply all the <code>flatmap-columns</code> in circuit <i>Bio<sub>M</sub></i>&rsquo;s <i>local</i> connectome. There are 240 of them, but one is empty, and another has only 1 node.
</p>

<p>
Using the index configured for a computation, <code>connsense-TAP</code> will load the inputs as configured for <code>input</code>, a
</p>

<div class="org-src-container">
<pre class="src src-example">~Mapping Argument --&gt; DataReference~
</pre>
</div>

<p>
We can reference a <code>connsense-TAP-Dataset</code> by combining <code>[computation-type, of_quantity]</code>. For <code>simplex-counts</code> we want the input to be the adjacency matrices loaded from the dataset resulting from extraction of the local edge population:
</p>
<div class="org-src-container">
<pre class="src src-yaml">  <span style="color: #BA36A5;">input</span>:
    <span style="color: #BA36A5;">adjacency</span>:
      <span style="color: #BA36A5;">dataset</span>: [<span style="color: #008000;">"extract-edge-populations"</span>, <span style="color: #008000;">"local"</span>]
</pre>
</div>

<p>
<code>connsense-TAP</code> will use the subset of this dataset that applies to the configured <code>index</code>.
</p>
</div>
</li>
</ol>
</div>
</div>
</div>
