documentation/present.html


<div id="outline-container-orgb93a331" class="outline-2">
<h2 id="orgb93a331"><span class="section-number-2">5.</span> TAP environment</h2>
<div class="outline-text-2" id="text-5">
<p>
A CLI environment will allow the scientist to setup, run, and interpret a TAP instance of their circuit analysis.
</p>

<pre class="example" id="orge3d5d91">

$ tap ?

&gt;&gt; What may I analyze for you today?

   1. anatomy
   2. physiology

</pre>

<p>
To which the scientist can respond,
</p>

<pre class="example" id="org696060d">

-- anatomy

&gt;&gt; What aspect of anatomy?

   1. composition
   2. connectivity
   3. something else that I am not aware of?

</pre>

<p>
We want to study the connectivity of flatmap columns,
</p>

<pre class="example" id="org357819d">

-- connectivity

</pre>

<p>
<code>tap-env</code> will look for any connectivity analyses in it&rsquo;s configuration, and not finding any definitions,
</p>

<pre class="example" id="orgef884ee">
 &gt;&gt; I did not find any connectivity analyses. Do you want to configure one? (yes/no)
</pre>

<p>
Let us say <i>yes</i>,
</p>

<pre class="example" id="org12762e0">

 -- yes

 &gt;&gt; What is the name of your analysis?

 -- simplex-counts

 &gt;&gt; Can you describe *simplex-counts*?

 -- Number of simplices in a network by dimension.

 &gt;&gt; Where can I find a method to compute *simplex-counts* ? It should be a path to a Python source file.

 --  path/to/source.py

 &gt;&gt; Which method in *path/to/source.py* should I use?

 -- simplex_counts

 &gt;&gt; What data-type does the method return?

 -- pandas.Series

 &gt;&gt; I have sufficient information to configure an analysis of circuit connectivity *simplex-count*

</pre>

<p>
<code>tap-env</code> can use the information provided to define a YAML cell,
</p>

<div class="org-src-container">
<pre class="src src-yaml" id="orgc2fd9ee">  <span style="color: #BA36A5;">simplex-counts</span>:
  <span style="color: #BA36A5;">description</span>: &gt;-
    <span style="color: #008000;">Number of simplices in a network by dimension, /i.e./ the number of nodes in the simplex.</span>
  <span style="color: #BA36A5;">source</span>: <span style="color: #008000;">"/gpfs/bbp.cscs.ch/project/proj83/analyses/topological-analysis-subvolumes/proj83/connectome_analysis/library/topology.py"</span>
  <span style="color: #BA36A5;">method</span>: <span style="color: #008000;">"simplex_counts"</span>
  <span style="color: #BA36A5;">output</span>: <span style="color: #008000;">"pandas.DataFrame"</span>
</pre>
</div>

<pre class="example" id="org6b56f8c">
&gt;&gt; Which circuit subtargets do you want to compute?

-- flatmap-columns

&gt;&gt; I do not about *flatmap-columns* subtargets. Should we configure them? (yes/no)

-- yes
</pre>

<p>
The scientist can now configure the computation of <code>flatmap-columns</code>,
</p>

<pre class="example" id="orgb8d4bcd">
&gt;&gt; What should we call these subtargets?

-- flatmap-columns

&gt;&gt; Can you describe *flatmap-columns*?

-- Conical columns, straight up along cortical layers, one per a hex-grid defined in the circuit's flatmap.

</pre>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Vishal Sood</p>
<p class="date">Created: 2022-10-04 Tue 14:43</p>
</div>
</body>
</html>
